posts/2024-08-10-dotnet-coverage/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dotnet Coverage for Manual Tests</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Dotnet Coverage for Manual Tests</h1>
</header><p>
Code coverage tools are a well known way to find untested code when working with
automated tests. I have recently learned that these tools can also be used when
performing manual tests. I know, it sounds obvious, but for some reason I have
never even considered it. And it turns out that its incredible easy to do using
<a href="https://learn.microsoft.com/en-us/dotnet/core/additional-tools/dotnet-coverage">dotnet-coverage</a>. The official repository contains a few sweet <a href="https://github.com/microsoft/codecoverage/blob/main/samples/Calculator/scenarios/scenario08/README.md">examples</a>.
</p>

<p>
Here is another one:
</p>

<div class="org-src-container">
<pre class="src src-sh"># Setup
git clone https://github.com/fwinkelbauer/chunkyard
cd chunkyard/src/Chunkyard
dotnet tool install --global dotnet-coverage
dotnet build

# Start coverage
dotnet-coverage collect --session-id my-session --server-mode --background --include-files **/*.dll

# Perform manual tests
dotnet run -- store --help
dotnet run -- store --repository example --paths . --preview

# Create coverage report "output.coverage"
dotnet-coverage shutdown my-session
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2024-08-10</p>
<footer>
<p>© 2026 Florian Winkelbauer</p>
</footer>
</div>
</body>
</html>
